{
  "como entro em contato com o suporte?": "Envie um e-mail para suporte@faculdade.edu.br",
  "olá": "Olá! Como posso ajudar você hoje?",
  "oi": "Oi! Em que posso ser útil?",
  "bom dia": "Bom dia! Espero que você tenha um ótimo dia!",
  "boa tarde": "Boa tarde! Como posso ajudar você?",
  "boa noite": "Boa noite! Precisa de alguma informação?",
  "obrigado": "De nada! Estou aqui para ajudar.",
  "valeu": "Por nada! Se precisar de mais alguma coisa, é só avisar.",
  "ok": "Ok! Se precisar de mais alguma coisa, estou à disposição.",
  "tchau": "Tchau! Tenha um ótimo dia!",
  "como faço login no site?": "Para fazer login, o usuário deve informar seu e-mail e senha nos campos indicados na tela de login.",
  "quem pode acessar o sistema?": "O sistema pode ser acessado por alunos e professores da instituição.",
  "como o sistema identifica se sou aluno ou professor?": "Após o login, o sistema identifica automaticamente se o usuário é aluno ou professor, com base nos dados cadastrados.",
  "como cadastrar um aluno?": "Para cadastrar um aluno, é necessário informar nome completo, curso e período.",
  "como cadastrar um professor?": "O cadastro de professor exige nome completo, CPF ou RG e validação se é um docente registrado pela instituição.",
  "como o professor cria uma turma?": "O professor pode abrir novas turmas informando o nome da disciplina e o período correspondente.",
  "como o professor adiciona ou remove alunos da turma?": "O professor pode gerenciar os alunos de suas turmas, adicionando ou removendo conforme necessário.",
  "como o professor publica uma atividade?": "O professor pode lançar novas atividades informando título, descrição, prazo e anexos.",
  "como o professor corrige atividades?": "O professor pode corrigir as atividades enviadas pelos alunos e registrar as notas no sistema.",
  "o professor pode conversar com os alunos?": "Sim. O professor pode enviar e ler mensagens no chat integrado da turma.",
  "como o aluno visualiza suas turmas?": "O aluno pode ver todas as turmas em que está matriculado na área de turmas.",
  "como o aluno envia uma atividade?": "O aluno pode submeter atividades na página da turma, anexando arquivos e textos conforme solicitado.",
  "como o aluno vê suas notas?": "O aluno pode consultar as notas atribuídas pelos professores na área de atividades ou boletim.",
  "o aluno pode usar o chat da turma?": "Sim. O aluno pode enviar e ler mensagens no chat da turma.",
  "o que é o repositório de atividades da turma?": "É o espaço onde o professor publica atividades e os alunos podem enviar suas respostas.",
  "como ocorre a correção das atividades?": "Cada atividade permite que o professor registre uma nota e comentários sobre a entrega do aluno.",
  "o site possui chat integrado?": "Sim. Cada turma possui um chat que permite a comunicação entre professores e alunos.",
  "o sistema é seguro?": "Sim. Todas as senhas são armazenadas de forma criptografada e os dados seguem a LGPD.",
  "quais dados pessoais o sistema armazena?": "O sistema guarda apenas dados essenciais, como nome, CPF, e-mail e informações do curso.",
  "posso pedir para excluir meus dados pessoais?": "Sim. O usuário tem direito de solicitar a exclusão de seus dados do sistema.",
  "o site pede autorização para coletar informações?": "Sim. O sistema solicita consentimento antes de coletar e usar informações pessoais.",
  "o sistema é rápido?": "Sim. Ele deve responder ao login em até 3 segundos em 95% das tentativas.",
  "quantas pessoas o sistema suporta ao mesmo tempo?": "O sistema foi projetado para suportar pelo menos 200 usuários simultâneos.",
  "o site fica disponível o tempo todo?": "O sistema deve ter 99% de disponibilidade durante o horário comercial.",

  "pra que serve o site?": "O site foi desenvolvido para facilitar a comunicação e a organização entre professores e alunos. Nele, os professores podem criar turmas, publicar atividades e avaliar alunos, enquanto os alunos podem enviar tarefas, visualizar notas e participar de chats da turma.",
  "para que serve o site?": "O site serve como uma plataforma educacional que conecta professores e alunos, permitindo criar turmas, enviar atividades e acompanhar notas.",
  "qual a função do site?": "A função do site é integrar alunos e professores em um ambiente virtual de aprendizado, com turmas, tarefas e chat.",
  "o que o site faz?": "O site permite gerenciar turmas, enviar atividades, corrigir tarefas e manter comunicação entre alunos e professores.",
  "para que esse site foi criado?": "O site foi criado para ajudar no gerenciamento de turmas, atividades e comunicação entre professores e alunos."

}